#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=e2584cbb-77a2-443d-b6c7-e3436ddf47eb-00685ac7-79c2-49be-91b5-9996f272ffab-4f2ea9b9-9fb0-4dd3-9011-de40855fb0f3]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=2022-07-20 09:21:38.954091054 +0000 UTC]
azurerm_resource_group.rg-projectf-dev-001: Refreshing state... [id=/subscriptions/039c5e5c-dcac-426f-9174-a04e1c39f8a3/resourceGroups/rg-projectf-dev-001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_application.ACR-application will be created
  + resource "azuread_application" "ACR-application" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "GithubActionsAcrAccess"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
    }

  # azuread_application_password.ACR-application-password will be created
  + resource "azuread_application_password" "ACR-application-password" {
      + application_object_id = (known after apply)
      + display_name          = (known after apply)
      + end_date              = "2299-12-31T00:00:00Z"
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # github_actions_secret.service-principal-password-github-secret will be created
  + resource "github_actions_secret" "service-principal-password-github-secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "Project-F"
      + secret_name     = "GithubActionsAcrAccessSecret"
      + updated_at      = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + application-passoword-output = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Retoxx-dev, Action: `pull_request`*